InformationRegisters/ВерсииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ВерсииОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВерсияОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторВерсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВерсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненоВФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ВерсионированиеОбъектовПривилегированный/Ext/Module.bsl
// Записывает версию объекта в регистр сведений
Процедура ЗаписатьВерсиюОбъекта(знач Ссылка,
                                знач ЧислоВерсийОбъекта,
                                знач ХранилищеДанных) Экспорт
	
	МенеджерЗаписиВерсииОбъектов = РегистрыСведений.ВерсииОбъектов.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписиВерсииОбъектов.Объект        	= Ссылка;
	МенеджерЗаписиВерсииОбъектов.ДатаВерсии    	= ТекущаяДата();
	МенеджерЗаписиВерсииОбъектов.ВерсияОбъекта 	= ХранилищеДанных;
	МенеджерЗаписиВерсииОбъектов.НомерВерсии	= ЧислоВерсийОбъекта + 1;
	МенеджерЗаписиВерсииОбъектов.АвторВерсии	= ПараметрыСеанса.ТекущийПользователь;
	
	МенеджерЗаписиВерсииОбъектов.Записать();
	
КонецПроцедуры

// Возвращает количество версий объекта переданного по ссылке
Функция ПолучитьКоличествоВерсийОбъекта(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	| ВЫБРАТЬ ЕСТЬNULL(МАКСИМУМ(НомерВерсии), 0) КАК НомерВерсии
	| ИЗ РегистрСведений.ВерсииОбъектов
	| ГДЕ Объект = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	НомерВерсии = Выборка.НомерВерсии;
	
	Возврат НомерВерсии;
	
КонецФункции

Процедура ВыполнитьСжатиеВерсийОбъектовПоРегламентномуЗаданию() Экспорт
	
	Возврат;
	
	//Запрос = Новый Запрос;
	//
	//Запрос.Текст = "ВЫБРАТЬ Объект,  НомерВерсии, ВерсияОбъекта 
	//				| ИЗ РегистрСведений.ВерсииОбъектов 
	//				| ГДЕ УдалитьСжато = Ложь";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	ДвоичныеДанные  = Выборка.ВерсияОбъекта.Получить();
	//	ХранилищеДанных = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
	//	
	//	МенеджерЗаписиВерсииОбъектов = РегистрыСведений.ВерсииОбъектов.СоздатьМенеджерЗаписи();
	//	
	//	МенеджерЗаписиВерсииОбъектов.Объект        = Выборка.Объект;
	//	МенеджерЗаписиВерсииОбъектов.НомерВерсии   = Выборка.НомерВерсии;
	//	
	//	МенеджерЗаписиВерсииОбъектов.Прочитать();
	//	МенеджерЗаписиВерсииОбъектов.ВерсияОбъекта = ХранилищеДанных;
	//	МенеджерЗаписиВерсииОбъектов.УдалитьСжато  = Истина;
	//	МенеджерЗаписиВерсииОбъектов.Записать();
	//	
	//КонецЦикла;
	//
КонецПроцедуры

Процедура ВыгрузитьСнимкиОбъектовВФайл() Экспорт
	
	Каталог = Константы.КаталогФайловИстории.Получить();
	Если НЕ ЗначениеЗаполнено(Каталог) Тогда
		Возврат;
	КонецЕсли;
	Каталог = Каталог + ?(Прав(Каталог, 1) <> "\", "\", "");
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 700
	               |	ВерсииОбъектов.Объект КАК Объект
	               |ПОМЕСТИТЬ ВТ_Объекты
	               |ИЗ
	               |	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
	               |ГДЕ
	               |	ВерсииОбъектов.СохраненоВФайл = ЛОЖЬ
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВерсииОбъектов.Объект КАК Объект,
	               |	ВерсииОбъектов.НомерВерсии,
	               |	ВерсииОбъектов.ВерсияОбъекта,
	               |	ВерсииОбъектов.ДатаВерсии,
	               |	ВерсииОбъектов.АвторВерсии
	               |ИЗ
	               |	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
	               |ГДЕ
	               |	ВерсииОбъектов.Объект В
	               |			(ВЫБРАТЬ
	               |				ВТ_Объекты.Объект
	               |			ИЗ
	               |				ВТ_Объекты КАК ВТ_Объекты)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Объект";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Объект") Цикл
		ОбМетаданные = Выборка.Объект.Метаданные();
		Если Метаданные.Документы.Содержит(ОбМетаданные) Тогда
			КаталогДляСохранения = Каталог + "Документы\";
		ИначеЕсли Метаданные.Справочники.Содержит(ОбМетаданные) Тогда
			КаталогДляСохранения = Каталог + "Справочники\";
		Иначе
			КаталогДляСохранения = Каталог + "Прочие\";
		КонецЕсли;	
		Пока Выборка.Следующий() Цикл
			Если Выборка.ВерсияОбъекта.Получить() = Неопределено Тогда
				Продолжить;
			КонецЕсли;	
			КаталогПолный = КаталогДляСохранения + Формат(Выборка.ДатаВерсии, "ДФ=yyyyMM") + "\" + Формат(Выборка.ДатаВерсии, "ДФ=dd") + "\";
			СоздатьКаталог(КаталогПолный);
			ХранилищеСнимок = Новый ХранилищеЗначения(Выборка.ВерсияОбъекта.Получить(), Новый СжатиеДанных(9));
			ЗначениеВФайл(КаталогПолный + Выборка.Объект.УникальныйИдентификатор() + "_" + Формат(Выборка.НомерВерсии, "ЧН=; ЧГ=0") + ".his", ХранилищеСнимок);
			Запись = РегистрыСведений.ВерсииОбъектов.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.ВерсияОбъекта = Новый ХранилищеЗначения(Неопределено);
			Запись.СохраненоВФайл = Истина;
			Запись.Записать();
		КонецЦикла;
		
		//Набор = РегистрыСведений.ВерсииОбъектов.СоздатьНаборЗаписей();
		//Набор.Отбор.Объект.Установить(Выборка.Объект);
		//Набор.Отбор.НомерВерсии.Установить(Выборка.НомерВерсии);
		//Набор.Прочитать();
		//Для Каждого Запись Из Набор Цикл
		//	Запись.СохраненоВФайл = Истина;
		//	Запись.ВерсияОбъекта = Новый ХранилищеЗначения(Неопределено);
		//КонецЦикла;	
		//Набор.Записать();
	КонецЦикла;	
	
КонецПроцедуры
